run/cylinderFlap_FSI3/fluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       11716;
    }
    outlet
    {
        type            patch;
        nFaces          43;
        startFace       11756;
    }
    top
    {
        type            wall;
        nFaces          132;
        startFace       11799;
    }
    bottom
    {
        type            wall;
        nFaces          132;
        startFace       11931;
    }
    plate
    {
        type            wall;
        nFaces          84;
        startFace       12063;
    }
    cylinder
    {
        type            wall;
        nFaces          61;
        startFace       12147;
    }
    defaultFaces
    {
        type            empty;
        nFaces          11962;
        startFace       12208;
    }
)

// ************************************************************************* //
