run/cylinderFlap_FSI3/fluid/system/fvSolution
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 root "";
 case "";
 instance "";
 local "";
 class dictionary;
 object fvSolution;
}

solvers
{
  Up
  {
      solver BiCGStab;
      preconditioner Cholesky;

      tolerance 1e-10;
      relTol 0;

      minIter 1;
      maxIter 500;
  }

  p
  {
    solver           PCG;
    preconditioner   DIC;
    tolerance        1e-09;
    relTol           0;
  }
  pFinal
  {
    solver           PCG;
    preconditioner   DIC;
    tolerance        1e-09;
    relTol           0;
  }
  U
  {
    solver PBiCG;
    preconditioner DILU;
    tolerance 1e-10;
    relTol 0;
    minIter 0;
  }
  UFinal
  {
    solver PBiCG;
    preconditioner DILU;
    tolerance 1e-10;
    relTol 0;
    minIter 0;
  }
}

blockSolver
{
    pRefCell 0;
    pRefValue 0;
    nOuterCorrectors 500;
    convergenceTolerance 1e-9;
}


PIMPLE
{
  nOuterCorrectors 100;
  nCorrectors 10;
  nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
  p 0.7;
  U 0.7;
}
